tylertms/dspic33e-sim/conformance/crc.c
static void fifo_cases(CrcConformance* state, Dspic33* cpu) {
    static const uint8_t widths[] = {1u, 8u, 9u, 16u, 17u, 24u, 25u, 32u};
    uint8_t width_index;
    for (width_index = 0u; width_index < sizeof(widths); width_index++) {
        uint8_t width = widths[width_index];
        uint8_t capacity = width <= 8u ? 16u : width <= 16u ? 8u : 4u;
        uint8_t index;
        configure(cpu, width, 16u, 0x1021u, false, false);
        for (index = 0u; index < capacity; index++) {
            enqueue(cpu, width, index);
        }
        expect(state, valid_words(cpu) == capacity, "width FIFO capacity");
        expect(state, (dspic33_read_word(cpu, CRC_CONTROL) & CRC_FULL) != 0u,
               "width FIFO full");
        enqueue(cpu, width, UINT32_MAX);
        expect(state, valid_words(cpu) == capacity, "full FIFO rejects word");
    }
    expect(state, dspic33_read_word(cpu, CRC_DATA_LOW) == 0u, "FIFO data read zero");
}

static void lane_cases(CrcConformance* state, Dspic33* cpu) {
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_byte(cpu, CRC_DATA_LOW, 0x12u);
    dspic33_write_byte(cpu, CRC_DATA_LOW + 1u, 0x34u);
    dspic33_write_word(cpu, CRC_DATA_LOW, 0x5678u);
    expect(state, valid_words(cpu) == 4u, "byte lanes enqueue four words");
    expect(state,
           cpu->io.crc.words[0] == 0x12u && cpu->io.crc.words[1] == 0x34u &&
               cpu->io.crc.words[2] == 0x78u && cpu->io.crc.words[3] == 0x56u,
           "byte lane order");

    configure(cpu, 16u, 16u, 0x1021u, false, false);
    dspic33_write_byte(cpu, CRC_DATA_LOW, 0x12u);
    expect(state, valid_words(cpu) == 0u, "word low byte waits");
    dspic33_write_byte(cpu, CRC_DATA_LOW + 1u, 0x34u);
    dspic33_write_word(cpu, CRC_DATA_LOW, 0x5678u);
    dspic33_write_word(cpu, CRC_DATA_HIGH, 0x9abcu);
    expect(state, valid_words(cpu) == 2u, "word high byte and word commit");
    expect(state, cpu->io.crc.words[0] == 0x3412u && cpu->io.crc.words[1] == 0x5678u,
           "word lane assembly");

    configure(cpu, 17u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_DATA_LOW, 0xabcdu);
    expect(state, valid_words(cpu) == 0u, "17-bit low half waits");
    dspic33_write_byte(cpu, CRC_DATA_HIGH, 0x01u);
    expect(state, valid_words(cpu) == 1u && cpu->io.crc.words[0] == 0x1abcdu,
           "17-bit low high-register byte commits");
    dspic33_write_byte(cpu, CRC_DATA_HIGH + 1u, 0x99u);
    expect(state, valid_words(cpu) == 1u, "17-bit unused lane does not commit");

    configure(cpu, 24u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_DATA_LOW, 0x3456u);
    dspic33_write_byte(cpu, CRC_DATA_HIGH, 0x12u);
    expect(state, valid_words(cpu) == 1u && cpu->io.crc.words[0] == 0x123456u,
           "24-bit lane assembly");

    configure(cpu, 25u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_DATA_LOW, 0x3456u);
    dspic33_write_byte(cpu, CRC_DATA_HIGH, 0x12u);
    expect(state, valid_words(cpu) == 0u, "25-bit third byte waits");
    dspic33_write_byte(cpu, CRC_DATA_HIGH + 1u, 0x01u);
    expect(state, valid_words(cpu) == 1u && cpu->io.crc.words[0] == 0x01123456u,
           "25-bit fourth byte commits");

    configure(cpu, 32u, 32u, 0x04c11db7u, false, false);
    dspic33_write_word(cpu, CRC_DATA_LOW, 0xcdefu);
    dspic33_write_word(cpu, CRC_DATA_HIGH, 0x89abu);
    expect(state, valid_words(cpu) == 1u && cpu->io.crc.words[0] == 0x89abcdefu,
           "32-bit word lane assembly");
}

static void run_vector(CrcConformance* state, Dspic33* cpu, const uint32_t* words,
                       uint8_t count, uint8_t data_width, uint8_t polynomial_width,
                       uint32_t polynomial, uint32_t seed, bool little_endian,
                       uint32_t expected, const char* name) {
    uint8_t index;
    configure(cpu, data_width, polynomial_width, polynomial, little_endian, false);
    dspic33_write_word(cpu, CRC_SHIFT_LOW, (uint16_t)seed);
    dspic33_write_word(cpu, CRC_SHIFT_HIGH, (uint16_t)(seed >> 16u));
    for (index = 0u; index < count; index++) {
        enqueue(cpu, data_width, words[index]);
    }
    start(cpu);
    expect(state,
           dspic33_device_advance(
               cpu, ((uint64_t)count * data_width + CRC_BITS_PER_CYCLE - 1u) /
                        CRC_BITS_PER_CYCLE),
           "vector advances");
    expect(state, shift_value(cpu) == expected, name);
    expect(state,
           expected == reference_crc(words, count, data_width, polynomial_width,
                                     polynomial, seed, little_endian),
           "literal vector matches independent reference");
    expect(state,
           (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u &&
               valid_words(cpu) == 0u,
           "vector completes and empties");
}

static void known_vector_cases(CrcConformance* state, Dspic33* cpu) {
    static const uint32_t text[] = {'1', '2', '3', '4', '5', '6', '7', '8', '9'};
    static const uint32_t text_with_zeros[] = {'1', '2', '3', '4', '5', '6',
                                               '7', '8', '9', 0u,  0u};
    static const uint32_t endian_words[] = {0x96u, 0u, 0u};
    static const uint32_t word16[] = {0x0201u, 0u};
    static const uint32_t word32[] = {0x04030201u, 0u};
    static const uint32_t narrow[] = {0x2au, 0x15u};
    static const uint32_t wide[] = {0x89abcdefu};
    static const uint32_t seeded[] = {0x31u};
    run_vector(state, cpu, text, 9u, 8u, 16u, 0x1021u, 0u, false, 0x31c3u,
               "CRC-16 text vector");
    run_vector(state, cpu, text_with_zeros, 11u, 8u, 16u, 0x1021u, 0u, false, 0xdf8bu,
               "CRC-16 text plus zeros vector");
    run_vector(state, cpu, endian_words, 3u, 8u, 16u, 0x1021u, 0u, false, 0xca99u,
               "MSB-first byte vector");
    run_vector(state, cpu, endian_words, 3u, 8u, 16u, 0x1021u, 0u, true, 0x05fau,
               "LSB-first byte vector");
    run_vector(state, cpu, word16, 2u, 16u, 16u, 0x1021u, 0u, false, 0xda58u,
               "16-bit data vector");
    run_vector(state, cpu, word32, 2u, 32u, 16u, 0x1021u, 0u, false, 0xf6feu,
               "32-bit data vector");
    run_vector(state, cpu, narrow, 2u, 6u, 5u, 0x04u, 0u, false, 0x03u,
               "narrow polynomial vector");
    run_vector(state, cpu, narrow, 2u, 6u, 5u, 0x04u, 0u, true, 0x12u,
               "narrow little-endian vector");
    run_vector(state, cpu, wide, 1u, 32u, 32u, 0x04c11db6u, 0u, false, 0x7bd7f146u,
               "32-bit polynomial vector");
    run_vector(state, cpu, wide, 1u, 32u, 32u, 0x04c11db6u, 0u, true, 0xdb503f73u,
               "32-bit little-endian vector");
    run_vector(state, cpu, seeded, 1u, 8u, 16u, 0x1021u, 0x1d0fu, false, 0xeaeeu,
               "seeded CRC vector");
    expect(state, interrupt_flag(cpu), "completion interrupt flag");
}

static void width_matrix_cases(CrcConformance* state, Dspic33* cpu) {
    uint8_t data_width;
    for (data_width = 1u; data_width <= 32u; data_width++) {
        uint8_t polynomial_width = (uint8_t)(((data_width * 7u) % 32u) + 1u);
        uint32_t word = (0xa5a5f00du ^ ((uint32_t)data_width * 0x10204081u)) &
                        width_mask(data_width);
        uint32_t polynomial = 0x04c11db6u ^ ((uint32_t)data_width * 0x01010101u);
        uint32_t seed = 0x1d0f5aa5u ^ ((uint32_t)data_width * 0x11111111u);
        uint32_t expected = reference_crc(&word, 1u, data_width, polynomial_width,
                                          polynomial, seed, (data_width & 1u) != 0u);
        configure(cpu, data_width, polynomial_width, polynomial,
                  (data_width & 1u) != 0u, false);
        dspic33_write_word(cpu, CRC_SHIFT_LOW, (uint16_t)seed);
        dspic33_write_word(cpu, CRC_SHIFT_HIGH, (uint16_t)(seed >> 16u));
        enqueue(cpu, data_width, word);
        start(cpu);
        expect(state,
               dspic33_device_advance(cpu, (data_width + CRC_BITS_PER_CYCLE - 1u) /
                                               CRC_BITS_PER_CYCLE),
               "width matrix advances");
        expect(state,
               shift_value(cpu) == expected && !cpu->io.crc.active &&
                   (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
               "width and polynomial matrix result");
    }
}

static void interrupt_timing_cases(CrcConformance* state, Dspic33* cpu) {
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    enqueue(cpu, 8u, 0x34u);
    start(cpu);
    expect(state,
           cpu->io.crc.active && valid_words(cpu) == 2u && cpu->events.count == 1u &&
               !interrupt_flag(cpu),
           "completion-select starts without interrupt");
    expect(state, dspic33_device_advance(cpu, 1u), "first word begins");
    expect(state,
           valid_words(cpu) == 1u && !interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_EMPTY) == 0u,
           "first word pop retains nonempty state");
    expect(state, dspic33_device_advance(cpu, 3u), "first word completes");
    expect(state, valid_words(cpu) == 1u && cpu->io.crc.active && !interrupt_flag(cpu),
           "first word completion does not interrupt");
    expect(state, dspic33_device_advance(cpu, 1u), "last word begins");
    expect(state,
           valid_words(cpu) == 0u && cpu->io.crc.active && !interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_EMPTY) != 0u,
           "completion-select empty remains active");
    expect(state, dspic33_device_advance(cpu, 3u), "last word completes");
    expect(state,
           !cpu->io.crc.active && interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "completion-select interrupts after final shift");

