tylertms/dspic33e-sim/conformance/crc.c
    configure(cpu, 8u, 16u, 0x1021u, false, true);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "empty-select begins word");
    expect(state,
           valid_words(cpu) == 0u && cpu->io.crc.active && interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) != 0u,
           "empty-select interrupts before final shift");
    clear_interrupt(cpu);
    expect(state, dspic33_device_advance(cpu, 3u), "empty-select completes word");
    expect(state,
           !cpu->io.crc.active && !interrupt_flag(cpu) &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "empty-select completion does not reinterrupt");

    configure(cpu, 8u, 16u, 0x1021u, false, true);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "refill first pop");
    clear_interrupt(cpu);
    enqueue(cpu, 8u, 0x34u);
    expect(state,
           valid_words(cpu) == 1u && cpu->io.crc.active && cpu->events.count == 1u,
           "refill joins active calculation");
    expect(state, dspic33_device_advance(cpu, 4u), "refill word begins");
    expect(state, valid_words(cpu) == 0u && cpu->io.crc.active && interrupt_flag(cpu),
           "refill empty transition reinterrupts");
    clear_interrupt(cpu);
    expect(state, dspic33_device_advance(cpu, 3u), "refill word completes");
    expect(state, !cpu->io.crc.active && !interrupt_flag(cpu),
           "refill completion follows empty-select mode");
}

static void lifecycle_cases(CrcConformance* state, Dspic33* cpu) {
    uint32_t partial;
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    start(cpu);
    expect(state,
           !cpu->io.crc.active && cpu->events.count == 0u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) != 0u,
           "GO waits for FIFO data");
    enqueue(cpu, 8u, 0x5au);
    expect(state, cpu->io.crc.active && cpu->events.count == 1u,
           "FIFO write starts pending GO");
    expect(state, dspic33_device_advance(cpu, 4u), "pending GO completes");
    expect(state, shift_value(cpu) == 0xfbbfu, "pending GO result");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    enqueue(cpu, 8u, 0x34u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "abort begins first word");
    partial = shift_value(cpu);
    dspic33_write_word(cpu, CRC_CONTROL, CRC_ENABLE);
    expect(state,
           !cpu->io.crc.active && valid_words(cpu) == 1u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "GO clear aborts current word and retains FIFO");
    expect(state, dspic33_device_advance(cpu, 8u), "aborted event expires");
    expect(state,
           shift_value(cpu) == partial && valid_words(cpu) == 1u &&
               cpu->events.count == 0u,
           "stale CRC event cannot resume abort");
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 4u), "retained FIFO restarts");
    expect(state, valid_words(cpu) == 0u && !cpu->io.crc.active,
           "restarted CRC completes retained FIFO");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, CRC_SHIFT_LOW, 0xa5a5u);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "seeded calculation begins");
    partial = shift_value(cpu);
    dspic33_write_word(cpu, CRC_SHIFT_LOW, 0xffffu);
    dspic33_write_word(cpu, CRC_SHIFT_HIGH, 0xffffu);
    expect(state, shift_value(cpu) == partial, "active CRCWDAT writes ignored");
    expect(state, dspic33_device_advance(cpu, 3u), "seeded calculation completes");

    configure(cpu, 8u, 16u, 0x1021u, true, true);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "disable begins calculation");
    clear_interrupt(cpu);
    dspic33_write_word(cpu, CRC_CONTROL, 0u);
    expect(state,
           dspic33_read_word(cpu, CRC_CONTROL) == CRC_EMPTY && shift_value(cpu) == 0u &&
               valid_words(cpu) == 0u && !cpu->io.crc.active &&
               cpu->io.crc.bits_remaining == 0u,
           "CRCEN clear flushes runtime state");
    expect(state,
           dspic33_read_word(cpu, CRC_CONFIG) == 0x070fu &&
               dspic33_read_word(cpu, CRC_POLYNOMIAL_LOW) == 0x1020u,
           "CRCEN clear preserves configuration");
    expect(state, dspic33_device_advance(cpu, 8u), "disabled stale event expires");
    expect(state, shift_value(cpu) == 0u && !interrupt_flag(cpu),
           "disabled stale event has no effect");
}

static void interrupt_service_cases(CrcConformance* state, Dspic33* cpu) {
    uint16_t priority_address = (uint16_t)(0x0840u + (CRC_IRQ / 4u) * 2u);
    uint16_t priority_shift = (uint16_t)((CRC_IRQ % 4u) * 4u);
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(
        cpu, 0x0828u, (uint16_t)(dspic33_read_word(cpu, 0x0828u) | CRC_INTERRUPT_FLAG));
    dspic33_write_word(cpu, priority_address,
                       (uint16_t)((dspic33_read_word(cpu, priority_address) &
                                   ~(7u << priority_shift)) |
                                  (CRC_PRIORITY << priority_shift)));
    cpu->program[(0x0014u + CRC_IRQ * 2u) / 2u] = CRC_VECTOR;
    cpu->w[15] = 0x1800u;
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 4u), "interrupt vector CRC completes");
    expect(state, dspic33_device_interrupt_pending(cpu), "CRC interrupt pending");
    expect(state,
           dspic33_device_service_interrupt(cpu) && cpu->last_interrupt == CRC_IRQ &&
               cpu->pc == CRC_VECTOR,
           "CRC interrupt 67 vectors");
    expect(state,
           dspic33_read_word(cpu, 0x08c8u) ==
               (uint16_t)((CRC_PRIORITY << 8u) | (CRC_IRQ + 8u)),
           "CRC interrupt status identifies vector");
}

static void no_dma_cases(CrcConformance* state, Dspic33* cpu) {
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    dspic33_write_word(cpu, 0x2200u, 0x5aa5u);
    dspic33_write_word(cpu, 0x0b00u, 0u);
    dspic33_write_word(cpu, 0x0b02u, CRC_IRQ);
    dspic33_write_word(cpu, 0x0b04u, 0x2200u);
    dspic33_write_word(cpu, 0x0b06u, 0u);
    dspic33_write_word(cpu, 0x0b0cu, CRC_SHIFT_LOW);
    dspic33_write_word(cpu, 0x0b0eu, 0u);
    dspic33_write_word(cpu, 0x0b00u, 0xa001u);
    enqueue(cpu, 8u, 0x5au);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 4u), "CRC with DMA channel completes");
    expect(state, interrupt_flag(cpu), "CRC completion still raises interrupt");
    expect(state,
           dspic33_read_word(cpu, 0x2200u) == 0x5aa5u && cpu->io.dma_index[0] == 0u &&
               cpu->io.dma_active == 0u && cpu->io.dma_peripheral_pending == 0u,
           "CRC interrupt makes no DMA request");
    expect(state, (dspic33_read_word(cpu, 0x0b00u) & 0x8000u) != 0u,
           "no CRC DMA request leaves one-shot channel enabled");
}

static void copy_reset_failure_cases(CrcConformance* state, Dspic33* cpu) {
    Dspic33 copy;
    bool initialized = dspic33_initialize(&copy);
    expect(state, initialized, "initialize CRC copy");
    if (!initialized) {
        return;
    }
    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    enqueue(cpu, 8u, 0x34u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "copy source begins CRC");
    expect(state, dspic33_copy(&copy, cpu), "copy active CRC");
    expect(state,
           copy.io.crc.active && copy.io.crc.bits_remaining == 6u &&
               copy.io.crc.count == 1u && copy.events.count == 1u,
           "copy retains active CRC state");
    expect(state, copy.events.items != cpu->events.items,
           "copy CRC event storage independent");
    expect(state, dspic33_device_advance(cpu, 7u) && dspic33_device_advance(&copy, 7u),
           "source and copy complete CRC");
    expect(state,
           shift_value(&copy) == shift_value(cpu) &&
               dspic33_read_word(&copy, CRC_CONTROL) ==
                   dspic33_read_word(cpu, CRC_CONTROL),
           "copied CRC result matches source");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    start(cpu);
    expect(state, dspic33_device_advance(cpu, 1u), "reset begins CRC");
    dspic33_reset(cpu, 0u);
    expect(state,
           dspic33_read_word(cpu, CRC_CONTROL) == CRC_EMPTY && !cpu->io.crc.active &&
               cpu->io.crc.count == 0u && cpu->events.count == 0u,
           "POR aborts CRC and clears events");

    configure(cpu, 8u, 16u, 0x1021u, false, false);
    enqueue(cpu, 8u, 0x12u);
    cpu->device_cycles = UINT64_MAX;
    start(cpu);
    expect(state,
           !cpu->io.crc.active && cpu->events.count == 0u && valid_words(cpu) == 1u &&
               (dspic33_read_word(cpu, CRC_CONTROL) & CRC_GO) == 0u,
           "CRC event overflow aborts without consuming FIFO");
    dspic33_destroy(&copy);
}

int main(void) {
    Dspic33 cpu;
    CrcConformance state = {0u, 0u, 0u};
    bool initialized = dspic33_initialize(&cpu);
    expect(&state, initialized, "initialize CRC processor");
    if (initialized) {
        reset_and_access_cases(&state, &cpu);
        fifo_cases(&state, &cpu);
        lane_cases(&state, &cpu);
        known_vector_cases(&state, &cpu);
        width_matrix_cases(&state, &cpu);
        interrupt_timing_cases(&state, &cpu);
        lifecycle_cases(&state, &cpu);
        interrupt_service_cases(&state, &cpu);
        no_dma_cases(&state, &cpu);
        copy_reset_failure_cases(&state, &cpu);
        dspic33_destroy(&cpu);
    }
    printf("[crc-summary] cases=%u passed=%u failed=%u\n", state.cases, state.passed,
           state.failed);
    return state.failed == 0u ? 0 : 1;
}
